output/posts/arpack/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>arpack | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/arpack/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../blas/" title="BLAS" type="text/html">
<link rel="next" href="../lapack/" title="LAPACK" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="arpack">
<meta property="og:url" content="https://chimez.github.io/posts/arpack/">
<meta property="og:description" content="ARPACK


新版本在 arpack-ng , 文档在 rice - ARPACK




函数说明


头文件 arpack.h 中的函数有


&lt;?&gt;neupd_c 计算一般矩阵的本征值, &lt;?&gt; = sdcz
&lt;?&gt;naupd_c 计算一般矩阵的反向通信接口, &lt;?&gt; = sdcz
&lt;?&gt;seupd_c 计算厄米矩阵的本征值, &lt;?&gt; = sd
&lt;?&gt;saupd_c 计算厄米矩阵的反向通">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-07T18:48:36+08:00">
<meta property="article:tag" content="eigen">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">arpack</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-05-07T18:48:36+08:00" itemprop="datePublished" title="2021-05-07 18:48">2021-05-07 18:48</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org13f1aa7" class="outline-2">
<h2 id="org13f1aa7">ARPACK</h2>
<div class="outline-text-2" id="text-org13f1aa7">
<p>
新版本在 <a href="https://github.com/opencollab/arpack-ng">arpack-ng</a> , 文档在 <a href="https://www.caam.rice.edu/software/ARPACK/UG/node135.html">rice - ARPACK</a>
</p>
</div>

<div id="outline-container-org046eb4a" class="outline-3">
<h3 id="org046eb4a">函数说明</h3>
<div class="outline-text-3" id="text-org046eb4a">
<p>
头文件 <code>arpack.h</code> 中的函数有
</p>
<ol class="org-ol">
<li>
<code>&lt;?&gt;neupd_c</code> 计算一般矩阵的本征值, <code>&lt;?&gt; = sdcz</code>
</li>
<li>
<code>&lt;?&gt;naupd_c</code> 计算一般矩阵的反向通信接口, <code>&lt;?&gt; = sdcz</code>
</li>
<li>
<code>&lt;?&gt;seupd_c</code> 计算厄米矩阵的本征值, <code>&lt;?&gt; = sd</code>
</li>
<li>
<code>&lt;?&gt;saupd_c</code> 计算厄米矩阵的反向通信接口, <code>&lt;?&gt; = sd</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-org52af175" class="outline-3">
<h3 id="org52af175">
<code>XYaupd</code> 参数说明</h3>
<div class="outline-text-3" id="text-org52af175">
<ol class="org-ol">
<li>
<code>ido</code>   反向通信标志，第一次运行 <code>ido=0</code>
</li>
<li>
<code>bmat</code>  问题类型标志，标准本征值问题 <code>bmat="I"</code> , 扩展本征值问题 <code>bmat="G"</code>
</li>
<li>
<code>n</code>  矩阵维数</li>
<li>
<code>which</code> Ritz值的位置 <code>which="LA", "SA", "LM", "SM", "BE"</code>
</li>
<li>
<code>nev</code> 计算本征值的个数 <code>0 &lt; nev &lt; n</code>
</li>
<li>
<code>tol</code> 浮点精度</li>
<li>
<code>resid</code> 残差向量</li>
<li>
<code>ncv</code> Lanczos 向量个数</li>
<li>
<code>v</code> Lanczos 向量， <code>ncv</code> 列</li>
<li>
<code>ldv</code> Lanczos 向量的首列长度</li>
<li>
<code>iparam</code> <code>int[11]</code> 的数组，保存了 11 个设置参数
<ol class="org-ol">
<li>
<code>iparam[0]=ishift</code> 选择隐式移动的方法， <code>ishift=0</code> 由用户指定， <code>ishift=1</code> 由约化三对角矩阵决定</li>
<li>
<code>iparam[1]=levec</code> 没用</li>
<li>
<code>iparam[2]=mxiter</code> 最大 Arnoldi 更新迭代次数</li>
<li>
<code>iparam[3]=nb</code> 块大小，只能取 <code>nb=1</code>
</li>
<li>
<code>iparam[4]=nconv</code> 收敛了的 Ritz 值个数</li>
<li>
<code>iparam[5]=iupd</code> 没用</li>
<li>
<code>iparam[6]=mode</code> 指定本征值问题的类型只能取 <code>mode = 1,2,3,4,5</code>
</li>
<li>
<code>iparam[7]=np</code> <code>ido=3</code> 时有用</li>
<li>
<code>iparam[8]=numop</code> OP*x 计算的次数</li>
<li>
<code>iparam[9]=numob</code> B*x 计算的次数</li>
<li>
<code>iparam[10]=numreo</code> 重正交化的次数</li>
</ol>
</li>
<li>
<code>ipntr</code> <code>int[11]</code> 的数组，保存指向 <code>workl</code>, <code>workd</code> 中起始位置的指针</li>
<li>
<code>workd</code> <code>3*N</code> 长的数组，算法内部使用</li>
<li>
<code>workl</code> <code>lworkl</code> 长的数组，算法内部使用</li>
<li>
<code>lworkl</code> <code>workl</code> 的长度，至少 <code>ncv**2 + 8*ncv</code>
</li>
<li>
<code>info</code> 运行提示和错误信息</li>
</ol>
</div>
</div>

<div id="outline-container-orgdd4ac2a" class="outline-3">
<h3 id="orgdd4ac2a">
<code>XYeupd</code> 参数说明</h3>
<div class="outline-text-3" id="text-orgdd4ac2a">
<ol class="org-ol">
<li>
<code>rvec</code> 指定是否产生本征矢 <code>rvec=true</code> 产生本征矢， <code>rvec=false</code> 只产生本征值</li>
<li>
<code>howmny</code> 指定产生本征矢的个数 <code>howmny="A"</code> 计算 <code>nev</code> 个， <code>howmny="P"</code> 计算 nev Schur 本征矢， <code>howmny="S"</code> 计算一部分本征值，由 <code>select</code> 指定</li>
<li>
<code>select</code> 指定计算的本征矢</li>
<li>
<code>dr</code> Ritz 值的实部</li>
<li>
<code>di</code> Ritz 值的虚部</li>
<li>
<code>z</code> Ritz 向量</li>
<li>
<code>ldz</code> Ritz 向量的首列维数</li>
<li>
<code>sigmar</code> shift 的实部, iparam[6]=3 or 4 时有效</li>
<li>
<code>sigmai</code> shift 的虚部</li>
<li>
<code>workev</code> 3*ncv 的内部数组</li>
<li>
<code>bmat</code>  以下参数与 <code>XYaupd</code> 相同</li>
<li><code>n</code></li>
<li><code>which</code></li>
<li><code>nev</code></li>
<li><code>tol</code></li>
<li><code>resid</code></li>
<li><code>ncv</code></li>
<li><code>v</code></li>
<li><code>ldv</code></li>
<li><code>iparam</code></li>
<li><code>ipntr</code></li>
<li><code>workd</code></li>
<li><code>workl</code></li>
<li><code>lworkl</code></li>
<li><code>info</code></li>
</ol>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/eigen/" rel="tag">eigen</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../blas/" rel="prev" title="BLAS">Previous post</a>
            </li>
            <li class="next">
                <a href="../lapack/" rel="next" title="LAPACK">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
